[
    {
        "name": "Vitamin C Serum",
        "category": "Treatment & Serums",
        "brand": "Mad Hippie",
        "price": "33.99",
        "details": "Tighten, brighten & smooth your skin! Mad Hippie's award-winning Vitamin C Serum is a harmonious blend of antioxidants that brightens, tightens & smooths the skin. Eight actives with konjac root, ferulic and hyaluronic acid. Konjac root is an exotic Asian flower that softens & smooths the skin and is rich in vitamins & nutrients. Ferulic acid is found in the cell walls of plants and has a compounding antioxidant effect when combined with vitamins C & E.   Key Ingredients:  Vitamin C (Sodium Ascorbyl Phosphate) - powerful antioxidant that can help reduce the appearance of wrinkles and discoloration Vitamin E - protective antioxidant that has been shown to reduce the appearance of wrinkles and discoloration Ferulic Acid - has been shown in studies to have a compounding antioxidant effect Hyaluronic Acid - applied topically it can help increase the plumped up look of the skin Konjac Root Powder - rich in nutrients such as copper, zinc, phosphorus, fatty acids, protein, carbohydrates, lipids, potassium, magnesium, iron, niacin, folic acid and vitamins A, E, C, D & B Grapefruit - rich in antioxidants and citric acid, grapefruit acts as a natural exfoliant Chamomile Extract - provides a thin protective shield, while naturally soothing and calming the skin Clary Sage - helps eliminate overly-dry or overly-oily skin and acts as natural toner and astringent  Benefits:  Vegan Cruelty-free \"The brand's Vitamin C Serum is a miracle worker.\" - Allure \"What we in the industry call MAGIC.\" - Marie Claire \"Best anti-aging products dermatologists swear by.\" - Women's Health",
        "how_to_use": "Rub in well, making sure products fully penetrate the skin.",
        "ingredients": [
            "WATERDEIONIZED",
            "VITAMINCSODIUMASCORBYLPHOSPHATE",
            "ALKYLBENZOATE",
            "VEGETABLEGLYCERIN",
            "WATER",
            "GLYCERIN",
            "SODIUMLEVULINATE",
            "SODIUMANISATE",
            "CLARYSAGESALVIASCLAREA",
            "GRAPEFRUITCITRUSGRANDIS",
            "HYALURONICACID",
            "AMORPHOPHALLUSKONJACROOTPOWDER",
            "ALOEBARBADENSISLEAF",
            "VITAMINETOCOTRIENOL",
            "FERULICACID",
            "CHAMOMILEFLOWEREXTRACTRECUTITAMATRICARIA",
            "SODIUMPHYTATE",
            "XANTHUMGUM",
            "HYDROXYETHYLCELLULOSE"
        ],
        "product_url": "https://www.ulta.com/vitamin-c-serum?productId=xlsImpprod18731235"
    },
    {
        "name": "Advanced Cleansing Rotating Facial Cleansing Brush",
        "category": "Skin",
        "brand": "ULTA",
        "price": "25.00",
        "details": "Ulta's Advanced Cleansing Rotating Facial Cleansing Brush provides dual-action gentle cleansing and exfoliation for a clearer-looking complexion. This cleansing brush is cordless and compact, perfect for use at home or while traveling.Kit Includes:1 Rotating Brush2 Removable Brush Heads: Soft Bristle & Silicone1 Set of AA Batteries1 Brush StandBenefits:Can be used with any type of cleanser and/or gentle scrubSoft Bristle Brush Head cleanses and exfoliates with gentle cleansing bristles Silicone Brush Head provides extra gentle cleansingSMART TIP! Replace your brush head every 3 months (Replacement brush heads available)",
        "how_to_use": "Step 1: Apply cleanser directly to moistened skin or to damp brush head.",
        "ingredients": [],
        "product_url": "https://www.ulta.com/advanced-cleansing-rotating-facial-cleansing-brush?productId=xlsImpprod18641015"
    },
    {
        "name": "Merry Bright Skincare for Her",
        "category": "By Price",
        "brand": "Beauty Finds by ULTA Beauty",
        "price": "9.99",
        "details": "Beauty Finds curated by Ulta Beauty.Make your own skincare wishes come true. Get that lit-from-within glow with Merry Bright Skincare for Her, our curated picks that renew, nourish and plump. Find what you love, then come back and shop the full size.Sampler includes:Clarins Hydra Essential Moisturizing Reviving Mask (0.1 oz)Kate Somerville ExfoliKate Intensive Exfoliating Treatment (0.25 oz)Kiehl¿s Since 1851 Kiehl¿s Rare Earth Mask (0.5 oz)Mamonde Lip Sleeping Mask (0.02 oz)Mario Badescu Super Collagen Mask (0.25 oz)Peter Thomas Roth Cucumber Gel Mask (0.47 oz)Phiolosophy Anti-Wrinkle Miracle Worker + Moisturizer (0.24 oz)Proactive Green Tea Moisturizer (0.33 oz)Strivectin Line Blurfector Instant Wrinkle Blurring Primer Deluxe (0.25 oz)Tula Skin Reviving Treatment Pad (0.21 oz)",
        "how_to_use": "",
        "ingredients": [],
        "product_url": "https://www.ulta.com/merry-bright-skincare-her?productId=pimprod2011077"
    },
    {
        "name": "Advanced Snail 96 Mucin Power Essence",
        "category": "Treatment & Serums",
        "brand": "COSRX",
        "price": "21.00",
        "details": "Enhance your skin's natural glow with nutrient-dense Advanced Snail 96 Mucin Power Essence from COSRX. This highly concentrated essence contains 96% snail mucin, a powerful ingredient known to aid in skin repair, hydration, brightness, and tone. Like a multivitamin for your skin, this replenishing essence contains nutrients to repair skin damage, boost elasticity, and maintain skin moisture.",
        "how_to_use": "After cleansing and toning, apply a small amount to your entire face. Gently pat to increase absorption and follow with serum and moisturizer.",
        "ingredients": [
            "SNAILSECRETIONFILTRATE",
            "BETAINE",
            "BUTYLENEGLYCOL",
            "HEXANEDIOL",
            "SODIUMHYALURONATE",
            "PANTHENOL",
            "ARGININE",
            "ALLANTOIN",
            "ETHYLHEXANEDIOL",
            "SODIUMPOLYACRYLATE",
            "CARBOMER",
            "PHENOXYETHANOL"
        ],
        "product_url": "https://www.ulta.com/advanced-snail-96-mucin-power-essence?productId=xlsImpprod15641052"
    },
    {
        "name": "Hydro Cool Firming Eye Gels",
        "category": "Eye Treatments",
        "brand": "Skyn Iceland",
        "price": "32.00",
        "details": "When you're run down and stressed out, the delicate skin under your eyes really takes a beating, resulting in puffiness and premature wrinkling. In just ten minutes, Skyn Iceland Hydro Cool Firming Eye Gels, a cooling transdermal gel patch, infuses the eye area with Icelandic glacial waters and concentrated doses of firming ingredients to de-puff, tone and reduce the appearance of fine lines and wrinkles. Peptides and botanicals improve blood flow and reduce puffiness while advanced antioxidants help prevent future damage. The patch, a cutting-edge delivery system, is easy to both apply and remove and is non-irritating.Free of parabens, petroleum, mineral oil, chemical sulfates and phthalates. 100% vegan and cruelty-free. Dermatologist tested for sensitive skin.(8 pairs x 0.11 oz.)2017 Good Housekeeping Beauty Lab Award Winner in Top Tested Eye Skincare",
        "how_to_use": "Remove backing and apply gel side to under eye area for ten minutes. Use once a week or whenever you need a quick fix!",
        "ingredients": [
            "WATERAQUAEAU",
            "POLYACRYLICACID",
            "GLYCERIN",
            "OLEAEUROPAEAOLIVEFRUITOIL",
            "ANGELICAARCHANGELICAROOTWATER",
            "SODIUMHYDROXIDE",
            "GINKGOBILOBALEAFEXTRACT",
            "ACETYLHEXAPEPTIDE",
            "HYDROLYZEDEXTENSIN",
            "AGAR",
            "CAPRYLYLGLYCOL",
            "PERFLUORODECALIN",
            "SIMMONDSIACHINENSISJOJOBASEEDOIL",
            "XANTHANGUM",
            "UBIQUINONE",
            "THYMUSVULGARISTHYMEFLOWERLEAFEXTRACT",
            "BUDDLEJADAVIDIIEXTRACT",
            "RUBUSCHAMAEMORUSARCTICCLOUDBERRYSEEDOIL",
            "OXYCOCCUSPALUSTRISARCTICCRANBERRYSEEDOIL",
            "ALUMINUMGLYCINATE",
            "POLYSORBATE",
            "CERAMIDENP",
            "HEXANEDIOL",
            "SUCROSEPALMITATE",
            "POTASSIUMSORBATE",
            "SODIUMBENZOATE"
        ],
        "product_url": "https://www.ulta.com/hydro-cool-firming-eye-gels?productId=xlsImpprod5830050"
    },
    {
        "name": "GinZing Refreshing Eye Cream to Brighten and Depuff",
        "category": "Eye Treatments",
        "brand": "Origins",
        "price": "32.00",
        "details": "A refreshing eye cream that instantly helps brighten, visibly diminish the look of dark circles & depuff for a wide awake look. What It Does: Formulated with Panax Ginseng & Caffeine from Coffee, this energizing eye cream instantly brightens & helps restore radiance to tired looking eyes as you help massage away visible dark circles, under eye bags & puffiness. Formulated Without:  Parabens Phthalates Sodium Lauryl Sulfate Propylene Glycol Mineral Oil DEA Petrolatum Paraffin Polyethylene beads Formaldehyde Animal Ingredients**Except cruelty-free honey & beeswax",
        "how_to_use": "Gently dab around eye area with ring finger in the A.M. or as needed.",
        "ingredients": [
            "WATERAQUAEAU",
            "METHYLTRIMETHICONE",
            "BUTYLENEGLYCOL",
            "PEGSTEARATE",
            "DIMETHICONE",
            "CETYLRICINOLEATE",
            "SILICA",
            "OLEAEUROPAEAOLIVEFRUITOIL",
            "GLYCERIN",
            "BEHENYLALCOHOL",
            "CUCUMISSATIVUSCUCUMBERFRUITEXTRACT",
            "PANAXGINSENGGINSENGROOTEXTRACT",
            "CASTANEASATIVACHESTNUTSEEDEXTRACT",
            "CAMELLIASINENSISGREENTEALEAFEXTRACT",
            "CORDYCEPSSINENSISEXTRACT",
            "MAGNOLIAOFFICINALISBARKEXTRACT",
            "PYRUSMALUSAPPLEFRUITEXTRACT",
            "SCUTELLARIABAICALENSISROOTEXTRACT",
            "PANTETHINE",
            "PANTHENOL",
            "CAPRYLICCAPRICTRIGLYCERIDE",
            "BUTYROSPERMUMPARKIISHEABUTTER",
            "CAFFEINE",
            "COLEUSBARBATUSEXTRACT",
            "YEASTEXTRACTFAEXEXTRAITDELEVURE",
            "FOLICACID",
            "HYDROGENATEDLECITHIN",
            "JOJOBAWAXPEGESTERS",
            "BIOTIN",
            "TRIBEHENIN",
            "MYRISTYLALCOHOL",
            "PALMITOYLTETRAPEPTIDE",
            "TREHALOSE",
            "SODIUMHYALURONATE",
            "ASCORBYLTOCOPHERYLMALEATE",
            "HESPERIDINMETHYLCHALCONE",
            "SODIUMSULFITE",
            "SODIUMMETABISULFITE",
            "STEARETH",
            "DIPEPTIDE",
            "ETHYLHEXYLGLYCERIN",
            "CARBOMER",
            "TROMETHAMINE",
            "SORBICACID",
            "CHLORPHENESIN",
            "PHENOXYETHANOL",
            "MICA",
            "TITANIUMDIOXIDECI",
            "IRONOXIDESCI",
            "CI",
            "CI"
        ],
        "product_url": "https://www.ulta.com/ginzing-refreshing-eye-cream-brighten-depuff?productId=xlsImpprod15071307"
    },
    {
        "name": "Pro-Collagen Cleansing Balm",
        "category": "Cleansers",
        "brand": "ELEMIS",
        "price": "64.00",
        "details": "Deep cleanses, softens, nourishes. The powerful, deep cleansing ELEMIS Pro-Collagen Cleansing Balm dissolves makeup, daily grime and pollutants. Skin is intensely cleansed, nourished and renewed for a glowing complexion. Luxurious rose and mimosa waxes are infused with nourishing elderberry, starflower and optimega oils and supercharged with anti-aging algae, padina pavonica. Not tested on animals. Luxury cleansing cloth included.  Key Ingredients & Benefits:  Padina Pavonica: A unique Mediterranean algae with proven outstanding anti-aging benefits Starflower Oil: Grown and pressed in the UK, it is the richest natural source of gamma linolenic acid, which promotes good skin health by helping to maintain skin metabolism Elderberry Oil: Contains high levels of essential fatty acids and other micronutrients, key elements of skin health   This product is free from:  Artificial color Parabens SLS, SLES DEA Mineral oil   The ELEMIS Promise:  Active Plant Extracts Skin Kind Results-Driven Formulations   Results:  96% agreed the product helped leave their skin feeling softened and soothed* 94% agreed that the product helped leave their skin feeling clean* 91% agreed the product was effective at removing makeup*   *Independent user trials  ",
        "how_to_use": "Warm into the palms and then massage over the face, neck and décolleté with light circular massage movements. Moisten fingertips and continue to massage. Gently wipe away warm, damp cotton cleansing cloth. For maximum absorption and deep cleansing, enjoy whilst in a warm bath. Balm may melt when warm but resets perfectly when cooled. Avoid contact with eyes.",
        "ingredients": [
            "PRUNUSAMYGDALUSDULCISSWEETALMONDOIL",
            "CAPRYLICCAPRICTRIGLYCERIDE",
            "PEGCAPRYLICCAPRICGLYCERIDES",
            "PEGBEESWAX",
            "CETEARYLALCOHOL",
            "SORBITANSTEARATE",
            "SAMBUCUSNIGRAELDERBERRYSEEDOIL",
            "PEGALMONDGLYCERIDES",
            "SILICA",
            "AVENASATIVAOATKERNELOIL",
            "TRITICUMVULGAREWHEATGERMOIL",
            "BUTYROSPERMUMPARKIISHEABUTTER",
            "CITRUSAURANTIUMDULCISORANGEPEELCERAWAX",
            "GLYCERIN",
            "LECITHIN",
            "PADINAPAVONICATHALLUSEXTRACT",
            "BORAGOOFFICINALISSTARFLOWERSEEDOIL",
            "LAVANDULAANGUSTIFOLIALAVENDEROIL",
            "PHENOXYETHANOL",
            "LINALOOL",
            "ACACIADECURRENSMIMOSAFLOWERWAX",
            "COCOSNUCIFERACOCONUTOIL",
            "ROSAMULTIFLORAROSEFLOWERCERAWAX",
            "LAVANDULAHYBRIDALAVANDINOIL",
            "PELARGONIUMGRAVEOLENSGERANIUMFLOWEROIL",
            "GERANIOL",
            "EUCALYPTUSGLOBULUSLEAFOIL",
            "TOCOPHEROL",
            "ANTHEMISNOBILISCHAMOMILEFLOWEROIL",
            "CITRONELLOL",
            "CINNAMOMUMCAMPHORAHOWOODWOODOIL",
            "LIMONENE",
            "MENTHAARVENSISMINTLEAFOIL",
            "SIMMONDSIACHINENSISJOJOBASEEDOIL",
            "CITRUSAURANTIUMDULCISORANGEOIL",
            "FRAGRANCEPARFUM",
            "VITISVINIFERAGRAPESEEDOIL",
            "MENTHOL",
            "EUGENIACARYOPHYLLUSCLOVELEAFOIL",
            "CITRICACID"
        ],
        "product_url": "https://www.ulta.com/pro-collagen-cleansing-balm?productId=xlsImpprod18731145"
    },
    {
        "name": "Regenerist Micro Sculpting Cream",
        "category": "Moisturizers",
        "brand": "Olay",
        "price": "28.99",
        "details": "''The Red Jar'' - known to many as their go-to, nonnegotiable face moisturizer with over 1 billion jars sold, Olay Regenerist Micro-Sculpting Face Cream is designed to visibly diminish wrinkles and fine lines starting day 1. Infused with vitamin B3, amino-peptides, hyaluronic acid and antioxidants for ultimate penetration, this moisture-binding formula instantly hydrates to improve elasticity and firm for a lifted look. Vitamin B3 not only helps with surface skin cell turnover and regeneration, but also leads the exfoliation that helps remove dead, dull skin for a fresher, younger look. Used as the last step in your routine, this luxurious-feeling moisturizer leaves skin hydrated, softens the look of fine lines and wrinkles and firms the look of skin with plumping hydration. Olay Regenerist's formula is designed to deliver moisture 10 layers deep into the skin's surface to reveal the skin you love to flaunt for years to come. Use Olay daily and see skin transformation in 28 days.",
        "how_to_use": "Smooth evenly over your entire cleansed face and neck morning and night.",
        "ingredients": [
            "WATER",
            "GLYCERIN",
            "ISOHEXADECANE",
            "NIACINAMIDE",
            "ISOPROPYLISOSTEARATE",
            "ALUMINUMSTARCHOCTENYLSUCCINATE",
            "NYLON",
            "DIMETHICONE",
            "PANTHENOL",
            "TOCOPHERYLACETATE",
            "PALMITOYLPENTAPEPTIDE",
            "SODIUMPEGOLIVEOILCARBOXYLATE",
            "SODIUMHYALURONATE",
            "CAPRYLICCAPRICTRIGLYCERIDE",
            "CERATONIASILIQUACAROBFRUITEXTRACT",
            "STEARYLALCOHOL",
            "POLYETHYLENE",
            "CETYLALCOHOL",
            "BEHENYLALCOHOL",
            "SODIUMACRYLATESCOPOLYMER",
            "TITANIUMDIOXIDE",
            "BENZYLALCOHOL",
            "METHYLPARABEN",
            "ETHYLPARABEN",
            "DIMETHICONOL",
            "POLYACRYLAMIDE",
            "FRAGRANCE",
            "PEGSTEARATE",
            "PROPYLPARABEN",
            "CETEARYLGLUCOSIDE",
            "CETEARYLALCOHOL",
            "CISOPARAFFIN",
            "DISODIUMEDTA",
            "CITRICACID",
            "STEARICACID",
            "PALMITICACID",
            "CPARETH",
            "LAURETH",
            "SODIUMHYDROXIDE",
            "MICA"
        ],
        "product_url": "https://www.ulta.com/regenerist-micro-sculpting-cream?productId=xlsImpprod5981450"
    },
    {
        "name": "Facial Spray with Aloe, Chamomile and Lavender",
        "category": "Moisturizers",
        "brand": "Mario Badescu",
        "price": "7.00",
        "details": "For times your skin is craving calm and comfort, Mario Badescu's Facial Spray with Aloe, Chamomile and Lavender is the mist to reach for. Chamomile, vitamin C, and Lavender essential water combine in a soothing blend that leaves your complexion balanced and bright.",
        "how_to_use": "Mist onto face, neck, or hair as needed. Use it to infuse more hydration before or after applying moisturizer, as a pick-me-up on the go, or post-makeup application to give skin a dewy finish. If product gets into eyes, rinse well with water.",
        "ingredients": [
            "AQUAWATER",
            "EAU",
            "LAVANDULAANGUSTIFOLIALAVENDERFLOWERWATER",
            "PROPYLENEGLYCOL",
            "POLYSORBATE",
            "ALOEBARBADENSISLEAFJUICE",
            "LAVANDULAANGUSTIFOLIALAVENDEROIL",
            "CHAMOMILLARECUTITAMATRICARIAFLOWEREXTRACT",
            "FUCUSVESICULOSUSEXTRACT",
            "ETHYLASCORBICACID",
            "THYMUSVULGARISTHYMELEAFEXTRACT",
            "SILVERCITRATE",
            "POTASSIUMSORBATE",
            "SODIUMBENZOATE",
            "BENZOPHENONE",
            "TRIETHANOLAMINE",
            "ZEOLITE",
            "SODIUMSULFATE",
            "CITRICACID",
            "SODIUMCHLORIDE",
            "CIVIOLET"
        ],
        "product_url": "https://www.ulta.com/facial-spray-with-aloe-chamomile-lavender?productId=xlsImpprod17411021"
    },
    {
        "name": "STEM CELLULAR CC Cream",
        "category": "Face",
        "brand": "Juice Beauty",
        "price": "39.00",
        "details": "Vegan & Cruelty-Free. Formulated with an organic base of botanical juices instead of added water.Beyond BB Cream, this 12-in-1 multi-tasking CC cream (color correcting) delivers the ultimate in age defying, skin perfecting results. The Juice Beauty STEM CELLULAR CC Cream is ideal for all skin types and especially beneficial for skin showing the signs of aging including fine lines, wrinkles, and sun damage. Available in multiple shades to match and enhance any skin type and color. Since Juice Beauty uses no artificial dyes, the colors are effective for skin tones ranging from very light to dark.Key Benefits:Reduces appearance of fine lines & wrinklesBroad spectrum sun protectionEvens skin toneSmoothes uneven textureCreates a radiant, glowing complexionRich in antioxidantsProtects with mineral SPF 30Ultimate moisturizerVisibly improves elasticitySkin perfecting colorMineral tinted coverageIdeal for all skin typesNo chemical sunscreenNon-nano natural sunscreen",
        "how_to_use": "After applying Juice Beauty's Stem Cellular Repair Booster Serum, apply a smooth, even layer to face, neck and decollete before sun exposure and to even skin tone & texture. Follow with Juice Beauty's Refining Finishing Powder for the perfect complexion.",
        "ingredients": [
            "ACTIVEZINCOXIDE"
        ],
        "product_url": "https://www.ulta.com/stem-cellular-cc-cream?productId=xlsImpprod4930069"
    },
    {
        "name": "Protect & Perfect Intense Advanced Day Cream SPF 30",
        "category": "Moisturizers",
        "brand": "No7",
        "price": "24.99",
        "details": "No7's Protect & Perfect Intense Advanced Day Cream SPF 30 is an award-winning, rich day time moisturizer that helps improve the appearance of deep lines, wrinkles and firms the skin. Prevents against future signs of aging with SPF 30 broad spectrum protection. Formulated with Matrixyl 3000, No7's powerful anti-wrinkle peptide technology and double defense technology for protection from the sun and environmental stressors. This supercharged formula helps restore younger looking skin in just 2 weeks.",
        "how_to_use": "Gently massage into your face and neck using smooth upwards movements after cleansing and facial serum in the morning.",
        "ingredients": [
            "AQUAWATER",
            "CALKYLBENZOATE",
            "GLYCERIN",
            "ALCOHOLDENAT",
            "CETEARYLGLUCOSIDE",
            "CYCLOPENTASILOXANE",
            "DIMETHICONE",
            "CYCLOHEXASILOXANE",
            "TRIBEHENIN",
            "CETEARYLALCOHOL",
            "METHYLMETHACRYLATECROSSPOLYMER",
            "AMMONIUMACRYLOYLDIMETHYLTAURATEVPCOPOLYMER",
            "PHENOXYETHANOL",
            "TOCOPHERYLACETATE",
            "POTASSIUMCETYLPHOSPHATE",
            "DIMETHICONOL",
            "PARFUMFRAGRANCE",
            "METHYLPARABEN",
            "ETHYLPARABEN",
            "SODIUMPCA",
            "XANTHANGUM",
            "ALCOHOL",
            "ZINCPCA",
            "ASCORBYLGLUCOSIDE",
            "TETRASODIUMEDTA",
            "MAGNESIUMPCA",
            "TBUTYLALCOHOL",
            "DIPROPYLENEGLYCOL",
            "HAMAMELISVIRGINIANAWITCHHAZELWATER",
            "POTASSIUMHYDROXIDE",
            "MANGANESEPCA",
            "SIMETHICONE",
            "POTASSIUMSORBATE"
        ],
        "product_url": "https://www.ulta.com/protect-perfect-intense-advanced-day-cream-spf-30?productId=xlsImpprod5140153"
    },
    {
        "name": "Dawn Patrol Classic Makeup Primer SPF30 Cucumber",
        "category": "Suncare",
        "brand": "COOLA",
        "price": "42.00",
        "details": "Nothing wakes up your skin like the crisp dawn air and cool water of an early morning surf. Keep that fresh-faced feeling and look all day with Dawn Patrol SPF 30 Makeup Primer. The silky-smooth formula provides a multitasking base for radiant skin and flawless makeup application. An antioxidant-rich blend of Honeysuckle, White Lily and Iris Stem Cells instantly enhances overall skin quality, while the broad spectrum SPF 30 shields and protects skin from damaging UV rays. Can be used alone or before foundation for flawless skin protection with the perfect photo finish! Non-clogging, translucent and infused with a natural Cucumber essence, it's ideal for all skin types and tones.   ",
        "how_to_use": "Apply liberally before sun exposure. Reapply immediately after swimming, sweating, or towel drying, and at least every two hours.",
        "ingredients": [
            "ACTIVEINGREDIENTSAVOBENZONESUNSCREEN",
            "OCTISALATESUNSCREEN",
            "OCTOCRYLENESUNSCREEN"
        ],
        "product_url": "https://www.ulta.com/dawn-patrol-classic-makeup-primer-spf30-cucumber?productId=xlsImpprod15721147"
    },
    {
        "name": "Sound Sleep Cocoon",
        "category": "Moisturizers",
        "brand": "Dermalogica",
        "price": "82.00",
        "details": "Dermalogica's Sound Sleep Cocoon is a revitalizing treatment gel-cream moisturizer that transforms skin overnight by optimizing the skin's recovery process. Persian silk tree extract provides antioxidant protection and fights free radicals while vitamin c brightens and reduces hyperpigmention. Wu-zhu-yu fruit extract provides visibly radiant skin by morning as it has powerful anti-inflammatory properties and it leaves skin looking plump and bouncy. Tamarind seed creates a nourishing cocoon effect to make skin ultra-soft and hydrated. Encapsulated, motion-activated french lavender, along with calming sandalwood, release throughout the night to help promote deep, restful sleep.Skin Concerns:DrynessFine lines and wrinklesDullness and uneven textureKey Ingredients:Tamarind Seed: Naturally occurring, moisturizes and reduces moisture loss and protects skin's barrier function.Persian Silk Tree: Provides overnight antioxidant protection and fights free radicals while brightening, reducing signs of fatigue.Wu-Zhu-Yu Fruit Extract: Powerful anti-inflammatory. Helps boost microcirculation in skin, enhancing skin radiance and luminosity.Key CalloutsThis product is:cruelty-freeveganparaben-freesulfate-freephthalate-freesynthetic fragrance-freehas recyclable packagingWe recommend that first-time Dermalogica users visit an authorized skin treatment professional for a client consultation in an ULTA store.View Dermalogica skin treatments at all ULTA locations. Book your appointment today.",
        "how_to_use": "Smooth over face and neck as the last step in your nighttime regimen. Allow gel-cream to melt into skin overnight.",
        "ingredients": [
            "WATERAQUAEAU",
            "DIMETHICONE",
            "GLYCERIN",
            "PROPANEDIOL",
            "POLYMETHYLSILSESQUIOXANE",
            "ALBIZIA",
            "JULIBRISSINBARKEXTRACT",
            "DIMETHICONEPEGCROSSPOLYMER",
            "SODIUMCHLORIDE",
            "EVODIARUTAECARPAFRUITEXTRACT",
            "LAVANDULAHYBRIDAABRIALHERBOIL",
            "TOCOPHERYLACETATE",
            "TERMINALIAFERDINANDIANAFRUITEXTRACT",
            "CAPRYLHYDROXAMICACID",
            "TRISODIUMETHYLENEDIAMINEDISUCCINATE",
            "TAMARINDUSINDICASEEDPOLYSACCHARIDE",
            "DIPROPYLENEGLYCOL",
            "LAVANDULAANGUSTIFOLIALAVENDERFLOWEREXTRACT",
            "ETHYLHEXYLGLYCERIN",
            "FUSANUSSPICATUSWOODOIL",
            "POGOSTEMONCABLINLEAFOIL",
            "SODIUMCITRATE",
            "PEGDIMETHICONE",
            "HEXANEDIOL",
            "POLYURETHANECROSSPOLYMER",
            "LIMONENE",
            "TOCOPHEROL",
            "CITRICACID",
            "LINALOOL",
            "PHENOXYETHANO"
        ],
        "product_url": "https://www.ulta.com/sound-sleep-cocoon?productId=xlsImpprod17491101"
    },
    {
        "name": "Coarse Discs",
        "category": "Tools",
        "brand": "PMD",
        "price": "20.00",
        "details": "Orange Disc - Coarse: The orange disc was designed for those who use the Personal Microderm weekly and want a higher level of exfoliation.Patented Spinning Disc Technology: Personal Microderm uses a patented spinning disc technology to deliver revolutionary microdermabrasion treatments and unmatched, brilliant results. The patented disc spins as it glides across the skin providing brilliant results with each treatment.Why Aluminum Oxide?: Aluminum oxide is a naturally occurring element that is extremely hard, second only to diamond. Aluminum Oxide crystals are non-airborne, hypoallergenic and antibacterial which helps prevent any adverse reactions and reduce spreading of bacteria which may cause irritations.Not just a treatment, YOUR treatment: Personal Microderm allows for complete treatment customization; whether extremely sensitive or precisely intense, there's a perfect disc for every skin type.Not Just for your Face: Personal Microderm delivers the same brilliant results on your neck, chest, arms, legs, hands and feet! The large body discs easily cover a greater surface area to more quickly treat the body. Smooth, soften and brighten your skin from head to toe.CLICK HERE for Disc Comparison Guide",
        "how_to_use": "The Personal Microderm should only be used once every 7 days. Each discs will last 3-4 uses. Most treatments will last three to five minutes. The size of the area being treated and the length of each treatment will ultimately determine how long a disc can be used. When inserting a new disc in your Personal Microderm, follow these steps:",
        "ingredients": [],
        "product_url": "https://www.ulta.com/coarse-discs?productId=xlsImpprod13211213"
    },
    {
        "name": "Professional Fast Tanning Mousse",
        "category": "Suncare",
        "brand": "St. Moriz",
        "price": "12.99",
        "details": "The St. Moriz Professional Fast Tanning Mousse is our best selling mousse ideal for those who like a quick fix tan. With a smart tanning complex, you can control your shade and achieve a light, sunkissed glow in just 1 hour, or wait 2 hours for a medium tan, and 3 hours for a more bronzed tan.Benefits:Made in EnglandStreak FreeSalon TestedWash Off Guide ColourFast ActivatingShade ControlDermatologically TestedWith Olive Milk & Vitamin E",
        "how_to_use": "Get the best results by following these simple steps:",
        "ingredients": [
            "AQUAWATERDIHYDROXYACETONE",
            "PROPYLENE",
            "GLYCOL",
            "ETHOXYDIGLYCOL",
            "COCAMIDOPROPYLBETAINE",
            "POLYSORBATE",
            "DIMETHICONECOPOLYOL",
            "DODIUMCHLORIDE",
            "PARFUMFRAGRANCE",
            "TOCOPHERYLACETATE",
            "BROMONITROPROPANE",
            "DIOL",
            "GLYCERIN",
            "PEGHYDROGENATEDCASTOROIL",
            "OLEAEUROPAEAOLIVEFRUITOIL",
            "POTTASSIUMSORBATE",
            "SINEADIPELAC",
            "SODIUMBENZOATE",
            "BENZYL",
            "SALICYLATE",
            "LIMONENE",
            "LINALOOL",
            "CIRED",
            "CIYELLOW",
            "CIBLUE"
        ],
        "product_url": "https://www.ulta.com/professional-fast-tanning-mousse?productId=xlsImpprod15721077"
    },
    {
        "name": "Organic Sunless Tan Firming Lotion",
        "category": "Suncare",
        "brand": "COOLA",
        "price": "46.00",
        "details": "Firm Up for What!Ready to look like you just returned from a tropical yoga retreat? Say hello to a healthy year-round tan and toned-looking body without the hassle of traveling halfway around the world!Nourish your skin with COOLA's ultra-moisturizing Organic Sunless Tan Firming Lotion that develops a gradual tan subtly and beautifully as you continue using it. A unique sugar beet-derived DHA delivers a natural runway-ready glow, while an exotic blend of green caffeine, seaweed, and pea extract helps offer a more tightened and toned appearance. Baobab Oil, harvested from the mythical ¿Tree of Life,¿ delivers an abundance of vitamins A, D and E to help your skin stay soft, supple, and sun-kissed no matter the season. Go ahead, get glowing!CAUTION: Family and friends may suspect that you¿re taking vacations without them.    ",
        "how_to_use": "For maximum color, apply generously to skin and spread evenly across body. Massage in circular motions and let dry before dressing. Allow 2-4 hours for tan to fully develop and reapply as needed. Allow 6-8 hours before showering. For best results, exfoliate skin with COOLA's 2-In-1 Mitt prior to application and use. Additional applications to already treated skin will increase maximum color. For less color, dilute with your favorite moisturizer prior to application. Designed to be streak-free and transfer-free.",
        "ingredients": [
            "WATERAQUA",
            "CAPRYLICCAPRICTRIGLYCERIDE",
            "DIHYDROXYACETONE",
            "CARTHAMUSTINCTORIUSSAFFLOWERSEEDOIL",
            "PROPANEDIOL",
            "POLYGLYCERYLSTEARATE",
            "CETEARYLALCOHOL",
            "GLYCERIN",
            "COCOCAPRYLATE",
            "ALOEBARBADENSISLEAFJUICEPOWDER",
            "BUTYROSPERMUMPARKIISHEABUTTER",
            "CAFFEINE",
            "ALARIAESCULENTAEXTRACT",
            "PISUMSATIVUMPEAEXTRACT",
            "LAVANDULAANGUSTIFOLIALAVENDERFLOWEREXTRACT",
            "HYDROLYZEDADANSONIADIGITATASEEDPROTEIN",
            "GLYCERYLSTEARATE",
            "SIMMONDSIACHINENSISJOJOBASEEDOIL",
            "TOCOPHEROL",
            "CETEARYLGLUCOSIDE",
            "STEARYLALCOHOL",
            "CITRICACID",
            "CARRAGEENAN",
            "FRAGRANCE",
            "GLUCONOLACTONE",
            "POTASSIUMSORBATE",
            "SODIUMBENZOATE"
        ],
        "product_url": "https://www.ulta.com/organic-sunless-tan-firming-lotion?productId=xlsImpprod17761875"
    },
    {
        "name": "NuLips RX Moisturizing Lip Balm + Exfoliating Lip Brush",
        "category": "Skincare Tools",
        "brand": "Nurse Jamie",
        "price": "26.00",
        "details": "The NuLipsRX system by Nurse Jamie helps to soften and plump your lips for that perfect pout. This system includes an anti-microbial silicone lip brush that gently exfoliates your lips, helping to remove dry skin and dead skin cells for smooth, baby soft lips. This lip balm is petroleum free and contains hyaluronic acid that helps plump your lips along with some of nature's most beneficial oils to hydrate, protect and moisturize.",
        "how_to_use": "Dampen your lips with warm water. Gently exfoliate your lips with the enclosed lip brush. Rinse with warm water and pat dry. Apply the lip balm. Use the lip balm as often as needed.",
        "ingredients": [
            "BISDIGLYCERYLPOLYACYLADIPATE",
            "CERAALBABEESWAX",
            "BUTYROSPERMUMPARKIISHEABUTTER",
            "SIMMONDSIACHINENSISJOJOBASEEDOIL",
            "HELIANTHUSANNUUSSUNFLOWERSEEDOIL",
            "CAPRYLICCAPRICTRIGLYCERIDE",
            "PRUNUSDULCISALMONDOIL",
            "FRAGRANCE",
            "LECITHIN",
            "CETEARYLETHYLHEXANOATE",
            "SORBITANISOSTEARATE",
            "PORTULACAPILOSAEXTRACT",
            "SUCROSECOCOATE",
            "PALMITOYLTRIPEPTIDE",
            "SODIUMHYALURONATE",
            "TOCOPHERYLACETATE",
            "CARYODENDRONORINOCENSENUTOIL"
        ],
        "product_url": "https://www.ulta.com/nulips-rx-moisturizing-lip-balm-exfoliating-lip-brush?productId=pimprod2005505"
    },
    {
        "name": "Hypoallergenic Firming Eye Cream",
        "category": "Eye Treatments",
        "brand": "Perricone MD",
        "price": "72.00",
        "details": "Perricone MD Hypoallergenic Firming Eye Cream is a deeply nourishing yet non-greasy cream that absorbs instantly to provide essential hydration to the delicate skin around the eyes. Ideal for dry or sensitive skin, this powerful but gentle cream is designed to firm & smooth skin's appearance without irritation or sensitivity. Hypoallergenic, non-comedogenic & dermatologist-tested.Same product, new look! Perricone MD Hypoallergenic Firming Eye Cream.",
        "how_to_use": "Gently pat onto eye area using your ring finger. Use morning & evening. Keep out of eyes.",
        "ingredients": [
            "WATERAQUA",
            "CAPRYLICCAPRICTRIGLYCERIDE",
            "GLYCERIN",
            "HYDROGENATEDPALMKERNELGLYCERIDES",
            "BISDIGLYCERYLPOLYACYLADIPATE",
            "CETYLALCOHOL",
            "GLYCERYLSTEARATE",
            "CETEARYLALCOHOL",
            "BUTYLENEGLYCOL",
            "SQUALANE",
            "DIMETHICONE",
            "ETHOXYDIGLYCOL",
            "PHENOXYETHANOL",
            "PEGSTEARATE",
            "AMMONIUMACRYLOYLDIMETHYLTAURATEVPCOPOLYMER",
            "PANTHENOL",
            "STEARETH",
            "ECTOIN",
            "CETETH",
            "XANTHANGUM",
            "HYDROGENATEDPALMGLYCERIDES",
            "ALLANTOIN",
            "ETHYLHEXYLGLYCERIN",
            "OLEAEUROPAEAOLIVELEAFEXTRACT",
            "STEARYLGLYCYRRHETINATE",
            "SODIUMHYALURONATE",
            "ELAEISGUINEENSISPALMOIL",
            "OLEAEUROPAEAOLIVEFRUITEXTRACT",
            "TOCOTRIENOLS",
            "TOCOPHEROL",
            "PHOSPHATIDYLCHOLINE",
            "NHYDROXYSUCCINIMIDE",
            "ACETYLTETRAPEPTIDE",
            "ACETYLOCTAPEPTIDE",
            "HYDROLYZEDSERICIN",
            "CHRYSIN",
            "PALMITOYLOLIGOPEPTIDE",
            "PALMITOYLTETRAPEPTIDEOLEAEUROPAEA",
            "ORGANICOLIVEJUICEEXTRACT"
        ],
        "product_url": "https://www.ulta.com/hypoallergenic-firming-eye-cream?productId=xlsImpprod19011049"
    },
    {
        "name": "Renewed Hope In A Jar SPF 30",
        "category": "Moisturizers",
        "brand": "Philosophy",
        "price": "39.00",
        "details": "Face a brighter future with Renewed Hope In A Jar SPF 30. This revolutionary lightweight formula is infused with clinically proven skin renewal technology to retexturize skin and deliver continuous hydration and all-day glow. In this unique formulation, Philosophy has boosted the benefits with the addition of broad spectrum SPF to help protect against harmful UVA/UVB rays, and ultimately, all signs of aging including increased pigmentation, poor texture, decreased and wrinkles. Reaffirm your commitment to beautiful skin with renewed hope and greet sunny days ahead with a smile. 92% of women agreed skin felt renewed and refreshed, with a healthy-looking glow lasting all day long.Key Benefits:Broad spectrum SPF 30 helps guard against harmful, skin-aging sun raysRefined texture with visibly smaller pores and fine lines virtually lifted awaySoft, dewy smoothness, comforted by instant and all-day hydration, plus re-energized healthy color and glow",
        "how_to_use": "Apply to clean face in the morning. Philosophy recommends using with Renewed Hope In A Jar Eye.",
        "ingredients": [
            "ACTIVEINGREDIENTSAVOBENZONE",
            "OCTINOXATE",
            "OCTOCRYLENE"
        ],
        "product_url": "https://www.ulta.com/renewed-hope-in-a-jar-spf-30?productId=xlsImpprod12791019"
    },
    {
        "name": "Purity Made Simple Hydra-Bounce Eye Gel",
        "category": "Eye Treatments",
        "brand": "Philosophy",
        "price": "24.00",
        "details": "Hydrate, moisturize and revive tired-looking eyes with Philosophy's unique cooling memory gel, featuring an eye area-awakening complex and good-for-skin ingredients. See less noticeable undereye bags, puffiness and shadows over time.  Clinically proven to hydrate for 24 hours* See a brighter-looking eye area all day** In just 3 days, women saw an improvement in the appearance of under-eye puffiness, bags and shadows** In 7 days, the appearance of dark circles is less noticeable**   Suitable for sensitive skin and eyes. Suitable for contact lens wearers. Ophthalmologist tested.  *24-hour clinical study with 24 subjects **2-week self-assessment study with 48 women aged 18-60",
        "how_to_use": "Gently apply a small amount under and around the eye area in the morning and evening.",
        "ingredients": [
            "AQUAWATEREAU",
            "GLYCERIN",
            "CAPRYLICCAPRICTRIGLYCERIDE",
            "BUTYLENEGLYCOL",
            "PEGHDICOPOLYMERBISDECYLTETRADECETHETHER",
            "LIMNANTHESALBAMEADOWFOAMSEEDOIL",
            "POLYGLYCERYLDIISOSTEARATE",
            "POLYSORBATE",
            "BUTYROSPERMUMPARKIISHEABUTTEREXTRACT",
            "PHENOXYETHANOL",
            "OLEAEUROPAEAOLIVEFRUITOIL",
            "TOCOPHERYLACETATE",
            "BISABOLOL",
            "CETEARYLOLIVATE",
            "CYCLOPENTASILOXANE",
            "SORBITANOLIVATE",
            "CAFFEINE",
            "PANTHENOL",
            "PROPYLENEGLYCOL",
            "CREATINE",
            "DIMETHICONOL",
            "SALVIAHISPANICASEEDOIL",
            "ACRYLATESCALKYLACRYLATECROSSPOLYMER",
            "PEG",
            "LECITHIN",
            "CYCLOHEXASILOXANE",
            "HYDROGENATEDLECITHIN",
            "ASCORBYLGLUCOSIDE",
            "BHT",
            "DISODIUMEDTA",
            "GINKGOBILOBALEAFEXTRACT",
            "SODIUMHYDROXIDE",
            "TOCOPHEROL",
            "AESCULUSHIPPOCASTANUMHORSECHESTNUTSEEDEXTRACT",
            "GLUCOSE",
            "LACTICACID",
            "CHLORPHENESIN",
            "ALCOHOLDENAT",
            "ASCORBYLPALMITATE",
            "PANTOLACTONE",
            "POTASSIUMSORBATE",
            "CAMELLIASINENSISLEAFEXTRACT",
            "COFFEAARABICACOFFEESEEDEXTRACT",
            "PONGAMIAPINNATASEEDEXTRACT",
            "SORBICACID",
            "CITRICACID",
            "ASCORBICACID",
            "SODIUMBENZOATE",
            "ANGELICAARCHANGELICAROOTEXTRACT",
            "CITRUSAURANTIUMAMARABITTERORANGEPEELEXTRACT",
            "MALTODEXTRIN",
            "POLYGLYCERYLDIISOSTEARATE",
            "MAGNESIUMALUMINUMSILICATE",
            "XANTHANGUM",
            "FARNESOL",
            "CAPRYLYLGLYCOL",
            "SCLEROTIUMGUM",
            "FDAMPCYELLOWNOCI"
        ],
        "product_url": "https://www.ulta.com/purity-made-simple-hydra-bounce-eye-gel?productId=xlsImpprod18931432"
    },
    {
        "name": "Puffy Eye Attack Super-Hydrating Under-Eye Brightening Hydrogel Patches",
        "category": "Eye Treatments",
        "brand": "Soap & Glory",
        "price": "5.00",
        "details": "Say goodb-eye to puffy, tired eyes with Soap & Glory's Puffy Eye Attack Super-Hydrating Under-Eye Brightening Hydrogel Patches, dreamy under-eye patches. With PUFFEASE technology (a tripeptide that reduces the appearance of puff) and super-naturally good ingredients including cucumber fruit juice and liquorice root extract, it¿s the perfect perk-me-up for peepers! Smoothes, revitalises, brightens and moisturises while you rest and relax. It¿s truly eye-mazing.",
        "how_to_use": "",
        "ingredients": [
            "AQUAWATER",
            "DIPROPYLENEGLYCOL",
            "GLYCERIN",
            "BUTYLENEGLYCOL",
            "HEXANEDIOL",
            "CETYLETHYLHEXANOATE",
            "CERATONIASILIQUALOCUSTBEANGUM",
            "CHONDRUSCRISPUSCARRAGEENANPOWDER",
            "GLYCYRRHIZAGLABRALICORICEROOTEXTRACT",
            "CELLULOSEGUM",
            "PHENOXYETHANOL",
            "SODIUMPOLYACRYLATE",
            "DISODIUMEDTA",
            "HYDROGENATEDPOLYDECENE",
            "POLYSORBATE",
            "MICA",
            "TRIDECETH",
            "CAPRYLICCAPRICTRIGLYCERIDE",
            "CUCUMISSATIVUSCUCUMBERFRUITEXTRACT",
            "ACETYLTETRAPEPTIDE",
            "CITITANIUMDIOXIDE",
            "CIBLUE"
        ],
        "product_url": "https://www.ulta.com/puffy-eye-attack-super-hydrating-under-eye-brightening-hydrogel-patches?productId=xlsImpprod17911283"
    },
    {
        "name": "Even Better Eyes Dark Circle Corrector",
        "category": "Eye Treatments",
        "brand": "Clinique",
        "price": "42.00",
        "details": "Clinique Even Better Eyes Dark Circle Corrector instantly brightens all skin tones. Cooling metal tip helps massage away puffs.Clinique Clean Philosophy:No parabensNo phthalatesNo fragranceJust happy skinWhat else is this product free of?Oil FreeFree of Denatured AlcoholFree of Synthetic ColoursSLS FreeSLES FreeSulfate FreeFormula Facts:Allergy TestedOphthalmologist testedAppropriate for contact lens wearersFor all skin types",
        "how_to_use": "Use twice a day, morning and night. Gently squeeze a small amount of product and glide contoured applicator back and forth across the undereye area. Use finger to smooth in any excess until absorbed. Reapply as needed throughout the day.",
        "ingredients": [
            "DIMETHICONE",
            "WATERAQUAEAU",
            "ISOSTEARYLPALMITATE",
            "POLYETHYLENE",
            "POLYSILICONE",
            "BUTYLENEGLYCOL",
            "ETHYLENEACRYLICACIDCOPOLYMER",
            "ISONONYLISONONANOATE",
            "POLYMETHYLSILSESQUIOXANE",
            "CETYLPEGPPGDIMETHICONE",
            "POLYMETHYLMETHACRYLATE",
            "MORUSNIGRAMULBERRYROOTEXTRACT",
            "CAMELLIASINENSISGREENTEALEAFEXTRACT",
            "SCUTELLARIABAICALENSISROOTEXTRACT",
            "SIGESBECKIAORIENTALISSTPAULSWORTEXTRACT",
            "OLEAEUROPAEAOLIVEFRUITEXTRACT",
            "WHEYPROTEINLACTISPROTEINPROTÉINEDUPETITLAIT",
            "VITISVINIFERAGRAPEFRUITEXTRACT",
            "TRITICUMVULGAREWHEATBRANEXTRACT",
            "YEASTEXTRACTFAEXEXTRAITDELEVURE",
            "CHOLESTEROL",
            "LINOLEICACID",
            "GLYCERIN",
            "PALMITOYLOLIGOPEPTIDE",
            "SUCROSE",
            "PYRIDOXINEDIPALMITATE",
            "PETROLATUM",
            "GLYCERYLPOLYMETHACRYLATE",
            "DIMETHICONECROSSPOLYMER",
            "CAFFEINE",
            "TOCOPHERYLACETATE",
            "GLYCERYLLAURATE",
            "QUATERNIUMBENTONITE",
            "PEG",
            "PHYTOSPHINGOSINE",
            "PEGPPGDIMETHICONE",
            "DIMETHICONESILYLATE",
            "MAGNESIUMASCORBYLPHOSPHATE",
            "PROPYLENECARBONATE",
            "TRIETHOXYCAPRYLYLSILANE",
            "SODIUMCHLORIDE",
            "DISODIUMEDTA",
            "PHENOXYETHANOL",
            "MICA",
            "TITANIUMDIOXIDECI",
            "IRONOXIDESCI",
            "IRONOXIDESCI",
            "IRONOXIDESCI"
        ],
        "product_url": "https://www.ulta.com/even-better-eyes-dark-circle-corrector?productId=xlsImpprod10791809"
    }
  ]
